coocox/Mplib/Toshaba/TMPM33x/TMPM333/cmsis_lib/lib/include/tmpm333_gpio.h
#define IS_GPIO_PD_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7)|| \
                                         ((param) == GPIO_PD_PULLUP_BIT_ALL))

#define IS_GPIO_PE_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_PE_PULLUP_BIT_ALL))

#define IS_GPIO_PF_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7)|| \
                                         ((param) == GPIO_PF_PULLUP_BIT_ALL))

#define IS_GPIO_PG_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7)|| \
                                         ((param) == GPIO_PG_PULLUP_BIT_ALL))

#define IS_GPIO_PH_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7)|| \
                                         ((param) == GPIO_PH_PULLUP_BIT_ALL))

#define IS_GPIO_PI_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7)|| \
                                         ((param) == GPIO_PI_PULLUP_BIT_ALL))

#define IS_GPIO_PJ_PULLUP_BIT(param)    (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6)|| \
                                         ((param) == GPIO_BIT_7)|| \
                                         ((param) == GPIO_PJ_PULLUP_BIT_ALL))

#define IS_GPIO_PK_PULLUP_BIT(param)    (((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_PK_PULLUP_BIT_ALL))

#define IS_GPIO_PA_PULLDOWN_BIT(param)  (((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_PA_PULLDOWN_BIT_ALL))

#define IS_GPIO_PE_OPEN_DRAIN_BIT(param) (((param) == GPIO_BIT_0)|| \
                                          ((param) == GPIO_BIT_1)|| \
                                          ((param) == GPIO_BIT_2)|| \
                                          ((param) == GPIO_BIT_3)|| \
                                          ((param) == GPIO_BIT_4)|| \
                                          ((param) == GPIO_BIT_5)|| \
                                          ((param) == GPIO_BIT_6)|| \
                                          ((param) == GPIO_PE_OPEN_DRAIN_BIT_ALL))

#define IS_GPIO_PF_OPEN_DRAIN_BIT(param) (((param) == GPIO_BIT_0)|| \
                                          ((param) == GPIO_BIT_1)|| \
                                          ((param) == GPIO_BIT_2)|| \
                                          ((param) == GPIO_BIT_3)|| \
                                          ((param) == GPIO_BIT_4)|| \
                                          ((param) == GPIO_BIT_5)|| \
                                          ((param) == GPIO_BIT_6)|| \
                                          ((param) == GPIO_BIT_7)|| \
                                          ((param) == GPIO_PF_OPEN_DRAIN_BIT_ALL))

#define IS_GPIO_PG_OPEN_DRAIN_BIT(param) (((param) == GPIO_BIT_0)|| \
                                          ((param) == GPIO_BIT_1)|| \
                                          ((param) == GPIO_BIT_2)|| \
                                          ((param) == GPIO_BIT_3)|| \
                                          ((param) == GPIO_BIT_4)|| \
                                          ((param) == GPIO_BIT_5)|| \
                                          ((param) == GPIO_BIT_6)|| \
                                          ((param) == GPIO_BIT_7)|| \
                                          ((param) == GPIO_PG_OPEN_DRAIN_BIT_ALL))

#define IS_GPIO_PA_FR1_BIT(param)       (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2)|| \
                                         ((param) == GPIO_BIT_3)|| \
                                         ((param) == GPIO_BIT_4)|| \
                                         ((param) == GPIO_BIT_5)|| \
                                         ((param) == GPIO_BIT_6))

#define IS_GPIO_PB_FR1_BIT(param)       (((param) == GPIO_BIT_0)|| \
                                         ((param) == GPIO_BIT_1)|| \
                                         ((param) == GPIO_BIT_2))

